Autodesk.Revit.DB.Electrical.PanelScheduleView.SwitchPhases(System.Int32,System.Int32)
Switches the circuit phases at the slot.
Remarks:
Only one or two poles circuit on switchboard panel schedule can switch phases.
nRow:
Row Number.
nCol:
Column Number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The circuit at given cell (nRow, nCol) is not one or two poles circuit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Body.
-or-
The given column number nCol is invalid in Body.
-or-
There is no circuit at given cell (nRow, nCol).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This is not a switchboard panel schedule.
Since:
2021

Autodesk.Revit.DB.Electrical.PanelScheduleView.RenumberIndexes
Renumbers the Circuit Naming Index for the circuits in the panel.
Since:
2021

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetLockSlot(System.Int32,System.Int32,System.Boolean)
Set lock state for a circuit slot at specific cell.
nRow:
Row Number
nCol:
Column Number
bLock:
Lock state to set
Since:
2023

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSlotLocked(System.Int32,System.Int32)
Check if the circuit slot in this cell is locked.
nRow:
Row Number
nCol:
Column Number
Returns:
True if the circuit slot in this cell is locked, false otherwise
False if the circuit slot not found.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
Returns:
The value of the spare's current parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
value:
The value of the spare's current for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
Returns:
The value of the spare's load parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
value:
The value of the spare's load for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetApparentPhaseValue(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Gets the apparent load for the given phase for the given slotted circuit
circuitId:
Circuit id for the apparent phase value
apparentLoadParam:
The requested apparent load phase parameter
Returns:
The value of the apparent phase
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationParamValue(Autodesk.Revit.DB.ElementId,System.Int32,System.Int32)
Gets the load classification parameter value.
parameterId:
Parameter Id of the Load Classification
nRow:
Row Number of the Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The value of the Load Classification parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetParamValue(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32,System.String)
Sets the text for the given cell, returns true if successful, false otherwise
sectionType:
The associated section
nRow:
Row Number of the Section
nCol:
Column Number of the Section
sValue:
String value to set the parameter
Returns:
Returns whether the function succeeded
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Thrown if there is no parameter at this cell
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if attempt to call on a template

Autodesk.Revit.DB.Electrical.PanelScheduleView.GenerateInstanceFromTemplate(Autodesk.Revit.DB.ElementId)
Assigns the data from the template to the instance and performs any tasks specific to the instance (3rd phase, borders, etc)
templateId:
Element id of the template element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleView.CreateInstanceView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of this view (using specific template)
ADoc:
The Document
templateId:
The templateId that this function will use
panelId:
Element id of the electrical panel element.
Returns:
The PanelScheduleView
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleView.CreateInstanceView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of this view (using default template)
ADoc:
The Document
panelId:
Element id of the electrical panel element.
Returns:
The PanelScheduleView
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null